#!/usr/bin/python
#-*- coding: utf-8 -*-
#Developer by Bafomet
import os
#set color
WHSL = '\033[1;32m'
ENDL = '\033[0m'
REDL = '\033[0;31m'
GNSL = '\033[1;34m'

page_1 = '''{1}
{1} ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------{1}

                           /$$$$$$   /$$$$$$  /$$$$$$ /$$   /$$ /$$$$$$$$                                                          
                          /$$__  $$ /$$__  $$|_  $$_/| $$$ | $$|__  $$__/                                                          
                         | $$  \ $$| $$  \__/  | $$  | $$$$| $$   | $$                                                             
                         | $$  | $$|  $$$$$$   | $$  | $$ $$ $$   | $$                                                             
                         | $$  | $$ \____  $$  | $$  | $$  $$$$   | $$                                                             
                         | $$  | $$ /$$  \ $$  | $$  | $$\  $$$   | $$                                                             
                         |  $$$$$$/|  $$$$$$/ /$$$$$$| $$ \  $$   | $$                                                             
                          \______/  \______/ |______/|__/  \__/   |__/                                                             
                                                                                      
                                                                                                          
                           /$$$$$$                                                            /$$   /$$     /$$                    
                          /$$__  $$                                                          |__/  | $$    |__/                    
                         | $$  \__/  /$$$$$$  /$$$$$$/$$$$  /$$$$$$/$$$$  /$$   /$$ /$$$$$$$  /$$ /$$$$$$   /$$  /$$$$$$   /$$$$$$$
                         | $$       /$$__  $$| $$_  $$_  $$| $$_  $$_  $$| $$  | $$| $$__  $$| $$|_  $$_/  | $$ /$$__  $$ /$$_____/
                         | $$      | $$  \ $$| $$ \ $$ \ $$| $$ \ $$ \ $$| $$  | $$| $$  \ $$| $$  | $$    | $$| $$$$$$$$|  $$$$$$ 
                         | $$    $$| $$  | $$| $$ | $$ | $$| $$ | $$ | $$| $$  | $$| $$  | $$| $$  | $$ /$$| $$| $$_____/ \____  $$
                         |  $$$$$$/|  $$$$$$/| $$ | $$ | $$| $$ | $$ | $$|  $$$$$$/| $$  | $$| $$  |  $$$$/| $$|  $$$$$$$ /$$$$$$$/
                          \______/  \______/ |__/ |__/ |__/|__/ |__/ |__/ \______/ |__/  |__/|__/   \___/  |__/ \_______/|_______/ 

  {0}Вы можете собрать очень большое количество информации по тематике OSINT в telegram каналах.{0}
  {0}Здесь представленны только самые информативные. {0}
         
  {2} Канала OSINT CLUB {2}                      {2}Investigation & Forensic tools{2}        {2}Записки сетевого выживальщика {2}
  
  {1}[{1}{2} Канал {2}{1}]{1} {0} @osint_club_channel{0}           {1}[{1}{2} Канал {2}{1}]{1} {0} @forensictools{0}            {1}[{1}{2} Канал {2}{1}]{1} {0} @NetSurvivalist{0}
  {1}[{1}{2} Управляющий {2}{1}]{1} {0}@tochka_osint {0}           {1}[{1}{2} Управляющий {2}{1}]{1} {0}@beholderishere {0}     {1}[{1}{2} Управляющий {2}{1}]{1} {0}@beholderishere {0}

{1} ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------{1}

  {2}Нетипичный ИБ {2}                           {2}Интернет - розыск {2}                    {2}Russian OSINT{2}
  
  {1}[{1}{2} Канал {2}{1}]{1} {0} @tmgroupsecurity{0}              {1}[{1}{2} Канал {2}{1}]{1} {0} @irozysk{0}                  {1}[{1}{2} Канал {2}{1}]{1} {0} @Russian_OSINT{0}
  {1}[{1}{2} Управляющий {2}{1}]{1} {0}@mifkelevra {0}             {1}[{1}{2} Управляющий {2}{1}]{1} {0}@irozysk_bot {0}        {1}[{1}{2} Управляющий {2}{1}]{1} {0}@russian_osint_bot {0}

{1} ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------{1}

  {2}OSINT| Сетевая разведка{2}
  
  {1}[{1}{2} Канал {2}{1}]{1} {0}@osintology{0}
  {1}[{1}{2} Управляющий {2}{1}]{1} {0}@OSINT_GROUP {0}

{1} ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------{1}


  {2}Если вы являетесь администратором канала по осинту и хотите добавления вашего канала в общий список, напишите мне в личку, 
  я просмотрю ваш канал и добавлю в список комьюнити.

  {0}[ {1}99{0} ] {2}Выйти в главное меню...                
'''.format(GNSL, REDL, WHSL)


def bx_menu():
    os.system("printf '\033]2; OSINT-SAN 3.5\a'")
    os.system('clear')
    print(page_1)

    while True:
        option = input(f"{REDL}  └──>{ENDL} Введите 99 для выхода : {ENDL} ")
        if option == '99':
            print()
            print("{1}[{0}+{1}]{2} Спасибо за использование нашего Exploit.".format(REDL, GNSL, WHSL))
            return
