#!/usr/bin/python
#-*- coding: utf-8 -*-
#Developer by Bafomet
import subprocess
import os
import sys
import readline
#set color
WHSL = '\033[1;32m'
ENDL = '\033[0m'
REDL = '\033[0;31m'
GNSL = '\033[1;34m'
os.system("printf '\033]2;OSINT Wiki\a'")
os.system('clear')
page_1 = '''{1}

                                  /$$ /$$       /$$                           /$$ /$$                                     /$$             /$$    
                                 |__/| $$      |__/                          | $$|__/                                    |__/            | $$    
                    /$$  /$$  /$$ /$$| $$   /$$ /$$  /$$$$$$   /$$$$$$   /$$$$$$$ /$$  /$$$$$$         /$$$$$$   /$$$$$$$ /$$ /$$$$$$$  /$$$$$$  
                   | $$ | $$ | $$| $$| $$  /$$/| $$ /$$__  $$ /$$__  $$ /$$__  $$| $$ |____  $$       /$$__  $$ /$$_____/| $$| $$__  $$|_  $$_/  
                   | $$ | $$ | $$| $$| $$$$$$/ | $$| $$  \ $$| $$$$$$$$| $$  | $$| $$  /$$$$$$$      | $$  \ $$|  $$$$$$ | $$| $$  \ $$  | $$    
                   | $$ | $$ | $$| $$| $$_  $$ | $$| $$  | $$| $$_____/| $$  | $$| $$ /$$__  $$      | $$  | $$ \____  $$| $$| $$  | $$  | $$ /$$
                   |  $$$$$/$$$$/| $$| $$ \  $$| $$| $$$$$$$/|  $$$$$$$|  $$$$$$$| $$|  $$$$$$$      |  $$$$$$/ /$$$$$$$/| $$| $$  | $$  |  $$$$/
                    \_____/\___/ |__/|__/  \__/|__/| $$____/  \_______/ \_______/|__/ \_______/       \______/ |_______/ |__/|__/  |__/   \___/  
                                                   | $$                                                                                          
                                                   | $$                                                                                          
                                                   |__/                                                                                          

                                                      {2}Добро пожаловать на вторую страницу по osint.
  {2}OSINT IP адреса

  {1}01.{1}{0}HostHunter https://github.com/SpiderLabs/HostHunter {2} — обнаружение и извлечение имен хостов из набора целевых IP-адресов
  {1}02.{1}{0}censys.io {2} находит какие серверы и устройства выставлены в сети.
  {1}03.{1}{0}cyber-hub.net https://cyber-hub.net/ip2skype.php — {2} Найдет Skype аккаунт.
  {1}04.{1}{0}spiderfoot.net — {2}Автоматический поиск с использованием огромного количества методов, 
              ножно использовать в облаке если пройти регистрацию.
  {1}05.{1}{0}iknowwhatyoudownload http://iknowwhatyoudownload.com — {2} Покажет что скачивают в интернете
  {1}06.{1}{0}recon.secapps.com https://recon.secapps.com/ {2} Автоматический поиск и создание карт взаимосвязей.
  {1}07.{1}{0}check.torproject.org https://check.torproject.org/cgi-bin/TorBulkExitList.py {2} — 
              найдет список всех выходных узлов Tor за последние 16 часов, которые мог связаться с IP
  {1}08.{1}{0}dnslytics.com https://dnslytics.com/reverse-ip — {2} Найдет домены.
  {1}09.{1}{0}yuleak.com — {2} Найдет серверы, домены, поддомены, услуги, darkweb, пароли, уязвимости, идентификаторы и многое другое.
        
{1}__________________________________________________________________________________________________________________________________{2}

  {2}Ищем пользователя по никнейму 2

  {1}01.{1}{0}namecheckup.com - {2} проверка сайтов и приложений
  {1}02.{1}{0}nstantusername.com - {2}проверка сайтов и приложений
  {1}03.{1}{0}suip.biz - {2} osintframework онлайн, проверь 300 сервисов, работает очень медленно
  {1}04.{1}{0}namechk.com - {2} проверка сайтов, приложений и доменных имен
  {1}05.{1}{0}sherlock https://github.com/sherlock-project/sherlock - {2} поиск аккаунта с этим ником
  {1}06.{1}{0}elody.com - {2} поиск по сайтам, поиск аккаунтов с таким же старым ником, поиск долго
  {1}07.{1}{0}@mailsearchbot - {2} поиск пароля, поиск по логину
  {1}08.{1}{0}whatsmyname.app - {2} быстрая проверка сайтов
  {1}09.{1}{0}boardreader.com - {2} поисковик по форумам, также поиск по нику
  {1}10.{1}{0}leakedsource.ru - {2}поиск по базам данных.
  {1}11.{1}{0}dumpedlqezarfife.onion -  {2}найдет письмо с паролем
  {1}12.{1}{0}Leakprobe.net - {2} найдет адрес электронной почты и источник утечки базы данных.
  {1}13.{1}{0}yasni.com - {2} автоматический поиск в Интернете.
  {1}14.{1}{0}social-searcher.com - {2} найдет упоминания в социальных сетях и на сайтах
  {1}15.{1}{0}socialmention.com - {2} найдет упоминания
        
{1}__________________________________________________________________________________________________________________________________{2}

  {2}Поиск по телефону Боты telegram 2 / Используйте осторожно, с левых номеров ( аккаунтов )


  {1}01.{1}{0}@Quick_OSINT_bot —{2} найдет оператора, email, как владелец записан в контактах, 
             базах данных и досках объявлений, аккаунты в соц. сетях и мессенджерах, в каких чатах состоит, документы, адреса и многое другое
  {1}02.{1}{0}@clerkinfobot —{2} бот берет данные из приложения getcontact, показывает как записан номер телефона в контактах
  {1}03.{1}{0}@dosie_Bot —{2} как и в боте uabaza дает информацио о паспорте только польностью, 3 бесплатные попытки
  {1}04.{1}{0}@find_caller_bot —{2} найдет ФИО владельца номера телефона
  {1}05.{1}{0}@get_caller_bot —{2} поиск по утечкам персональных данных и записным книгам абонентов, может найти ФИО, дату рождения, e-mail
  {1}06.{1}{0}@get_kolesa_bot —{2} найдет объявления на колеса.кз
  {1}07.{1}{0}@get_kontakt_bot —{2} найдет как записан номер в контактах, дает результаты что и getcontact
  {1}08.{1}{0}@getbank_bot —{2} дает номер карты и полное ФИО клиента банка
  {1}09.{1}{0}@GetFb_bot —{2} бот находит Facebook
  {1}10.{1}{0}@GetPhone_bot — {2} поиск номера телефона в утекших базах
  {1}11.{1}{0}@Getphonetestbot —{2}бот берет данные из приложения getcontact, показывает как записан номер телефона в контактах
  {1}12.{1}{0}@info_baza_bot —{2} поиск в базе данных
  {1}13.{1}{0}@mailsearchbot —{2} найдет часть пароля
  {1}14.{1}{0}@MyGenisBot — {2}найдет имя и фамилию владельца номера
  {1}15.{1}{0}@phone_avito_bot —{2} найдет аккаунт на Авито
  {1}16.{1}{0}@SafeCallsBot — {2}бесплатные анонимные звонки на любой номер телефона с подменой Caller ID
  {1}17.{1}{0}@usersbox_bot — {2}бот найдет аккаунты в ВК у которых в поле номера телефона указан искомый номер
        
{1}__________________________________________________________________________________________________________________________________{2}

  {2}Ресурсы
          
  {1}01.{1}{0}lampyre.io —{2} программа выполняет поиск аккаунтов, паролей и многих других данных
  {1}02.{1}{0}avinfo.guru —{2} проверка телефона владельца авто, иногда нужен VPN
  {1}03.{1}{0}fa-fa.kz —{2} найдет ФИО, проверка наличия задолженностей, ИП, и ограничения на выезд
  {1}04.{1}{0}getcontact.com —{2} найдет информацию о том как записан номер в контактах
  {1}05.{1}{0}globfone.com —{2} бесплатные анонимные звонки на любой номер телефона
  {1}06.{1}{0}mirror.bullshit.agency —{2} поиск объявлений по номеру телефона
  {1}07.{1}{0}mysmsbox.ru — {2}определяет чей номер, поиск в Instagram, VK, OK, FB, Twitter, 
             поиск объявлений на Авито, Юла, Из рук в руки, а так же найдет аккаунты в мессенджерах
  {1}08.{1}{0}nuga.app — {2}найдет Instagram аккаунт, авторизация через Google аккаунт и всего 1 попытка
  {1}09.{1}{0} umberway.com — {2}найдет телефонный справочник
  {1}10.{1}{0}personlookup.com.au —{2} найдет имя и адрес
  {1}11.{1}{0}phoneInfoga.crvx.fr — {2}определят тип номера, дает дорки для номера, определяет город
  {1}12.{1}{0}spravnik.com —{2} поиск по городскому номеру телефона, найдет ФИО и адрес
  {1}13.{1}{0}spravochnik109.link —{2} поиск по городскому номеру телефона, найдет ФИО и адрес
  {1}14.{1}{0}teatmik.ee — {2}поиск в базе организаций, ищет номер в контактах
  {1}15.{1}{0}truecaller.com —{2} телефонная книга, найдет имя и оператора телефона

  {2}Восстановление доступа

  {1}1.{1}{0}ICQ — icq.com/password/ru
  {1}2.{1}{0}Yahoo — login.yahoo.com/?display=login
  {1}3.{1}{0}Steam — help.steampowered.com/ru/wizard/HelpWithLoginInfo
  {1}4.{1}{0}Twitter — twitter.com/account/begin_password_reset
  {1}5.{1}{0}VK.com — vk.com/restore
  {1}6.{1}{0}Facebook — facebook.com/login/identify?ctx=recover
  {1}7.{1}{0}Microsoft — account.live.com/acsr
  {1}8.{1}{0}Instagram — instagram.com/accounts/password/reset
        
{1}__________________________________________________________________________________________________________________________________{2}


  {2}Узнаем владельца яндекс почты. При помощи ID
        
  {2}Переходим на yandex.ru/collections/user/НИКНЕЙМ. Нажимаем правой кнопкой мыши и выбираем "Просмотр кода страницы"
  находим "public_id" и публичный ID рядом (например: c48fhxw0qppa50289r5c9ku4k4)
  Подставляем public_id в ссылки
        {0}
  https://yandex.ru/user/public_id
  https://yandex.ru/collections/user/public_id
  https://zen.yandex.ru/user/public_id
  https://yandex.ru/q/profile/public_id
  https://local.yandex.ru/users/public_id
  https://n.maps.yandex.ru/#!/users/public_id
        {2}
  Подставляем NICKNAME в ссылки https://music.yandex.ru/user/NICKNAME/
{2}
  Восстановление пароля
        {0}
  https://passport.yandex.ru/auth/restore/password
  https://github.com/martinvigo/email2phonenumber
        
{1}__________________________________________________________________________________________________________________________________{2}


  {2}OSINT в vk.
        
  Узнаем регистрационные данные {0}
        
  https://regvk.com/
  https://regvk.com/id/
  https://vk.com/foaf.php?id=ВВЕДИТЕ_ID
  https://valery.shostak.ru/vk
  @Quick_OSINT_bot
{2}
  Упоминания пользователя {0}
        
  https://vk.com/feed?obj=1379097&q=&section=mentions1379097 - номер ID
{2}
  Закрытый аккаунт{0}
       
  https://online-vk.ru/pivatfriends.php?id=123456789  {2}

  Поиск в сохраненных профилях {0}
      
  https://ruprofile.pro/vk_user/id123456789
  https://rusfinder.pro/vk/user/id123456789 {2}

  Полноценные сервисы по ВК {0}
       
  http://vk.city4me.com/
  https://220vk.com/ 
  https://vkdia.com/

{2}
  Строим дерево связей {0}
    
  https://www.yasiv.com/vk {2}

  Архив страницы в ВК {0}

  https://archive.org/
  https://www.google.ru/
  https://vk.watch/ID/profile
{2}
{1}__________________________________________________________________________________________________________________________________{2}

  OffenOsint Virtual Machine - Виртуальная машина OffenOsint

  Система собрана для исключения необходимости развертывания боевого дистрибутива с нуля при работе на новой машине. 
  Сочетает в себе мощные инструменты активной разведки репозитария Kali Linux, 
  несколько фреймворков разведки полного цикла, прочие наиболее полезные скрипты, 
  инструменты для анонимизации своих действий в сети, инструменты  анализа собранных данных, а так же инструменты визуализации. 
  Plug and Play.
{0}
  https://github.com/Double2Sky/OffenOsint
        
{1}__________________________________________________________________________________________________________________________________{2}

  Деанонимизация в instagram.
     
  Определение Instagram ID {0}
  https://codeofaninja.com/tools/find-instagram-user-id {2}

  Определение аккаунта по телефону {0}
  https://nuga.app/ {2}

  Восстановление пароля {0}
  https://www.instagram.com/accounts/password/reset/ {2}

  Архив страницы {0}
  https://archive.org/
  https://www.google.ru/
  https://yandex.ru/ {2}

  Выгрузка данных бизнес-аккаунта {0}
  https://i.instagram.com/api/v1/users/profilePage_ID/info/ {2}

  JSON формат страницы {0}
  https://www.instagram.com/НИКНЕЙМ/?__a=1  {2}

  Анализ профиля {0}
     
  https://picalytics.ru/ 
  https://minter.io/
  https://nativeflow.io/

{1}__________________________________________________________________________________________________________________________________{2}

  Оценка благонадежности граждан России.
    
  Нахождение в розыске {0}
    
  https://www.interpol.int/notice/search/wanted
  https://mvd.ru/wanted
  http://fsin.su/criminal/
  https://fssp.gov.ru/iss/ip_search

  Список террористов {0}
   
  http://fedsfm.ru/documents/terrorists-catalog-portal-act {2}

  Действительность паспорта {0}
  
  http://сервисы.гувм.мвд.рф/info-service.htm?sid=2000 {2}

  Проверка ИНН {0}
  
  https://service.nalog.ru/inn.do {2}

  Кредиты {0}
  
  https://app.exbico.ru/ {2}
 
  Исполнительные производства {0}
  
  http://fssprus.ru/iss/ip {2}

  Налоговые задолженности {0}
   
  https://peney.net/ {2}

  Залоги имущества {0}
   
  https://www.reestr-zalogov.ru/state/index# {2}

  Банкротство {0}
  
  https://bankrot.fedresurs.ru/ {2}
 
  Участие в судопроизводстве {0}
  
  https://bsr.sudrf.ru/bigs/portal.html
  https://sudact.ru/
  https://mos-sud.ru/search
  https://mirsud.spb.ru/ {2}

  Участие в бизнесе {0}
  
  https://zachestnyibiznes.ru/ {2}

  Поиск в соцсетях {0}
  
  https://go.mail.ru/search_social {2}

  Проверка диплома {0}
  
  http://obrnadzor.gov.ru/ru/activity/main_directions/reestr_of_education/ {2}

{1}__________________________________________________________________________________________________________________________________{2}

  {1}Внимание, вы находитесь на странице ( 2 )

  {2}Дата последнего обновления:{0} вторник 27 января 2021г.

  {0}Проматай вверх сразу.

{1}__________________________________________________________________________________________________________________________________{2}

                                
  {0}[ {1}99{0} ] {2}Выйти в главное меню...        {0}[ {1}1{0} ] {2}Предыдущая страница. {0}[ {1}0{0} ] {2}Следующая страница.
'''.format(GNSL, REDL, WHSL)
def main():
    print(page_1)
    print("")
    option = input(REDL + "  └──>" + ENDL +" Введите 99 для выхода : " +ENDL + " ")
    
    while(1):
        if option == '99':
            print("")
            print(("{1}  [ {0}+{1} ]{2} Спасибо за использование нашего Exploit.").format(REDL, GNSL, WHSL))
            os.system("cd ..;python3 osintsan.py")
            exit()
            option = input(ENDL + ""+GNSL+"["+REDL + " menu " + GNSL + "]"+ENDL + " :")
            
        elif option == '1':
            print(("{1}  [ {0}+{1} ]{2} Переход...{3}").format(REDL, GNSL, WHSL, ENDL))
            os.system("python3 Information_services.py")
            exit()
            break
            
        elif option == '0':
            print(("{1} [ {0}+{1} ]{2} Переход...{3}").format(REDL, GNSL, WHSL, ENDL))
            os.system("python3 Information_services3.py")
            exit()
            break
              
        else:
            os.system("python3 Information_services2.py")
try:
    main()

except KeyboardInterrupt:
    sys.exit(1)
except KeyboardInterrupt:
        print ("Ctrl+C pressed...")
