#!/usr/bin/python
#-*- coding: utf-8 -*-
#Developer by Bafomet
from module.utils import COLORS

import os
import sys

page_1 = '''{1}
                                          {2}    Лицензионное соглашение
                                         
 {1} ⠀  ⠀⠀⠀⠀⠀⠀⠀⠆⢢⠀⠀⠀⠀⠀          {2}Об условиях использования данного программного обеспечения. {0}    
 {1}  ⢦⠀⠀⠀⠀⠀⠀⢰⢸⡄⡇⠀⠀⠀⠀                                                                                      
 {1} ⣾⣆⠳⡀⠀⠀⠀⠀⢸⢸⡇⢸⠀⠀⠀   {0}Запрещено копирование либо другое действие связанное в воровством кода продукта. Разрешено использование только с
 {1}⠀⠹⣿⣦⡱⡀⣀⣀⣀⣸⠈⡇⣸⠀⠀⠀   {0}official github продукта. После установки вы можете использовать продукт для сбора данных. Создатель не несет не какой
 {1}⠀⠘⣿⡿⠋⠉⠀⠈⠙⠀⢠⣷⣄⠀⠀⠀   {0}ответственности за ваши действия. Также вы обязуетесь посмотреть фильм с {2}Марком Уолбиргом{0} "{1} Планета Обезьян {0}" 
 {1}⠀⢀⣾⡟⠀⢀⠀⠀⡀⠀⢀⡈⢻⣿⣇    {0}после приобретения продукта.
 {1}⠀⢸⡿⠀⡄⢸⠀⠀⢳⠀⠀⢷⠀⠿⣿⡄ ⠀                         
 {1}⠀⢸⣇⣰⣁⣟⣤⣤⣼⣇⣀⣸⡄⢰⣾⣿ ⠀ {0}Вы обязуетесь, если увидите нас в баре, кафе, ресторане, налить нам виски либо бурбон.
 {1}⠀⠀⣿⣿⣟⠉⠉⢿⡏⠟⡟⠛⢿⢸⣿⣿ ⠀ {0}В случае нападения пришельцев на планету земля, вы обязаны:
 {1}⠀⠀⢻⣿⡁⠀⠀⠀⠀⣠⣿⠀⢸⣿⣿⣿⠀  {0}Приехать к bafomet и спасти его от пришельцев в Челябинске. В случае нарушения договора, во время нападения пришельцев
 {1}⠀⠀⢸⣿⣿⣷⡾⠚⢿⣿⣿⠀⣸⣿⣿⣿ ⠀ {0}Мы приедем к вам с армией пришельцев, натравим их на вас, шучу, а может и нет.
 {1}⠀⠀⠘⠛⠛⠻⣵⡲⣣⠛⠻⠴⠛⠛⠉⠀ ⠀ {0}Мы как Тони Старк только {2}OSINT-SAN{0}
 {1}⠀⠀⠀⠀⠀⣇⣿⡕⠻⣆⠐⠀⠀⠀⠀⠀ ⠀                         
 {1}⠀⠀⠀⣠⠊⠧⠊⠀⠀⠈⢻⡁⠀⠀⠀⠀ ⠀ {0}Также мы не несем ответственности, если вы используя наш OSINT framework, столкнётесь с айсбергом,
 {1}⠀⠀⠀⠀⢛⠤⠄⢀⣀⣀⣀⣈⣧⠀⠀⠀ ⠀ {0}или вас похитят инопланетяне, НО мы готовы ответить,
 {1}⠀⠀⠀⠀⠉⠁⣶⣶⣶⡖⠊⠁⠁⠀⠀⠀ ⠀ {0}если вы прорвете пространственно-временной континуум при помощи {2}OSINT-SAN.
 {1}⠀⠀⠀⠀⠀⢰⣿⠀⢻⣷⠀⠀⠀⠀⠀⠀ ⠀ {0}Интернет опасное место. Дерьмо случается.      
 {1}⠀⠲⠶⠿⠿⠿⠿⠿⠿⠿⠿⠿⠶⠖⠂⠂ ⠀ {0}Наш продукт развивается пока только за счет донатов пользователей. Если вы внесли нам донат, спасибо большое.
                            
                    {0}Дата последнего обновления:{1} вторник 25 февраля 2021г.

                    {0}Над продуктом работали: {2}
                   
                    Maxim  [ Bafomet ].              Леха  [ l3e86 ].       ketre3 [ KTRE ] 
                                                                                                          
                                                          
   {0}[ {1}99{0} ] {2} Я согласен, согласна...
'''.format(COLORS.GNSL, COLORS.REDL, COLORS.WHSL)


def sogl():
    os.system("printf '\033]2;OSINT-SAN 3.5\a'")
    os.system('clear')
    print(page_1)

    while True:
        try:
            option = input(
                f"{COLORS.REDL}   └──>{COLORS.ENDL} 'Введите 99 для выхода в menu :  {COLORS.ENDL} ")
        except KeyboardInterrupt:
            option = "99"

        if option == '99':
            return


if __name__ == '__main__':
    sogl()
