#!/usr/bin/python
#-*- coding: utf-8 -*-
#Developer by Bafomet
import os
import sys
import readline
import subprocess

WHSL = '\033[1;32m'
ENDL = '\033[0m'
REDL = '\033[0;31m'
GNSL = '\033[1;34m'

page_1 = '''{1} {1} 
 
  {0} ██████╗ ███████╗██╗███╗   ██╗████████╗    ███████╗ █████╗ ███╗   ██╗{0}     {2} Dev Bafomet {2}                              
  {0}██╔═══██╗██╔════╝██║████╗  ██║╚══██╔══╝    ██╔════╝██╔══██╗████╗  ██║{0}     {2} Разработано для диванных кибер армий СНГ 
  {0}██║   ██║███████╗██║██╔██╗ ██║   ██║       ███████╗███████║██╔██╗ ██║{0}     {2} Во славу и честь, за сиськи и минет...   
  {0}██║   ██║╚════██║██║██║╚██╗██║   ██║       ╚════██║██╔══██║██║╚██╗██║{0}     {2} Версия{2} {1} 2.0 {1}                 
  {0}╚██████╔╝███████║██║██║ ╚████║   ██║       ███████║██║  ██║██║ ╚████║{0}
  {0} ╚═════╝ ╚══════╝╚═╝╚═╝  ╚═══╝   ╚═╝       ╚══════╝╚═╝  ╚═╝╚═╝  ╚═══╝{0}                                                  
                                                                                                                            
    {2} Бортовой журнал{2}{0} OSINT {0}{2}ресурсов....{2}      {2} Вы можете добавить и свои сервисы в официальный репозиторий написав мне. {2} {1}https://t.me/satana666mx {1}                       


          {2}   Начнем с простого...     {2}            {0} Поиск по Email, Gmail {0}                                 

         {1}1.{1} {0}haveibeenpwned.com {0} — {2} проверка почты в слитых базах {2}
         {1}2.{1} {0}emailrep.io{0} — {2}найдет на каких сайтах был зарегистрирован аккаунт использующий определенную почту {2}
         {1}3.{1} {0}dehashed.com{0} —{2} проверка почты в слитых базах {2}
         {1}4.{1} {0}@Smart_SearchBot{0} — {2}найдет ФИО, дату рождения и адрес с телефоном{2}
         {1}5.{1} {0}intelx.io{0} — {2}многофункциональный поисковик, поиск осуществляется еще и по даркнету {2}
         {1}6.{1} {0}@mailsearchbot{0} —{2} ищет по базе, дает часть пароля{2}
         {1}7.{1} {0}@info_baza_bot{0} —{2} покажет из какой базы слита почта, 2 бесплатных скана{2}
         {1}8.{1} {0}leakedsource.ru{0} —{2} покажет в каких базах слита почта {2}
         {1}9.{1} {0}mostwantedhf.info{0} —{2} найдет аккаунт skype{2}
         {1}10.{1} {0}spiderfoot.net{0} (r) — {2}автоматический поиск с использованием огромного количества методов, можно использовать в облаке если пройти регистрацию {2}
         {1}11.{1} {0}reversegenie.com{0} —{2} найдет местоположение, Первую букву имени и номера телефонов{2}
         {1}12.{1} {0}@last4mailbot{0} — {2}бот найдет последние 4 цифры номера телефона клиента Сбербанка {2}
         {1}13.{1} {0}searchmy.bio {0}— {2}найдет учетную запись Instagram с электронной почтой в описании {2}
         {1}14.{1} {0}leakprobe.net{0} —{2} найдет ник и источник слитой базы {2}
         {1}15.{1} {0}recon.secapps.com{0} —{2} автоматический поиск и создание карт взаимосвязей{2}
         {1}16.{1} {0}account.lampyre.io {0}(r) —{2} веб версия поиска по email, поиск по аккаунтам  в соц. сетях и мессенджерам {2}
         {1}17.{1} {0}@EyeGodBot {0}— {2}найдет аккаунт в ВК и найдет утекшие пароли{2}
         {1}18.{1} {0}@GetPhone_bot{0} —{2} поиск в утекших базах {2}
         {1}19.{1} {0}@StealDetectorBOT {0}— {2}найдет утекшие пароли {2}
         {1}20.{1} {0}[TOP] @GetGmail_bot {0}— {2}бот найдет ID аккаунта, даст ссылку на Google Maps и альбомы, 2 бесплатных результата и бесконечное число попыток{2}
         {1}21.{1} {0}scylla.sh{0} —{2} поисковик по базам утечек, найдет пароли, IP, ники и многое другое, в поле поиска введите email: и после e-mail адрес {2}

         {2}    Используй с удовольствием. {2}          {0} Поиск по никнейму. {0}

         {1}1.{1} {0}namecheckup.com{0}—{2} найдет аккаунты с искомым ником{2}
         {1}2.{1} {0}instantusername.com{0} —{2} проверка по сайтам и приложениям{2}
         {1}3.{1} {0}https://suip.biz/ru/?act=sherlock {0} — {2}osintframework онлайн, автоматический поиск по 300 сервисам, работает очень медленно, дождитесь ответа{2}
         {1}4.{1} {0}namechk.com{0} — {2}проверка по сайтам, приложениям и доменам {2}
         {1}5.{1} {0}sherlock http://github.com/sherlock-project/sherlock {0} —{2}0 поиск аккаунтов с таким ником {2}
         {1}6.{1} {0}@mailsearchbot{0} — {2}найдет часть пароля, поиск по логину{2}
         {1}7.{1} {0}whatsmyname.app{0} —{2} очень быстрый поиск по сотням сайтов{2}
         {1}8.{1} {0}boardreader.com{0} —{2} поисковик по форумам, ищет и по нику{2}
         {1}9.{1} {0}leakedsource.ru{0} —{2} покажет в каких базах есть ник{2}
         {1}10.{1}{0}dumpedlqezarfife.onion {0} — {2}найдет почту с паролем{2}
         {1}11.{1}{0}https://leakprobe.net/search.php {0} —{2} найдет почту и источник слитой базы {2} 
         {1}12.{1}{0}http://www.yasni.com/ {0} —{2} автоматический поиск по интернету {2}
         {1}13.{1}{0}social-searcher.com {0}— {2}найдет упоминания в соц. сетях и на сайтах{2}
         {1}14.{1}{0}socialmention.com {0}—{2}найдет упоминания{2}
         {1}15.{1}{0}@StealDetectorBOT{0}—{2}найдет утекшие пароли аккаунта{2}
         {1}16.{1}{0}pastebeen.com {0} —{2} поиск в базе текстов pastebin, поиск может занять несколько часов {2}
         {1}17.{1}{0}scylla.sh{0} —{2} поисковик по базам утечек, найдет пароли, e-mail, IP и многое другое, в поле поиска введите username: и после ник, например username:somebody1 {2}
         {1}18.{1}{0}Maigret https://github.com/soxoj/maigret {0}  —{2} найдет аккаунты с таким же ником, там найдет их ID и проведёт поиск по новым данным {2}


         {2}  Поиск по ФИО гражданина России. {2}        {0} Осторожнее с ботами, не использовать со своим номером {0}

         {1}1.{1}{0}@egrul_bot{0} —{2} найдет ИП и компании {2}
         {1}2.{1}{0}reestr-zalogov.ru{0}— {2}поиск по залогодателям, даст паспортные данные, место и дату рождения и т.д. {2}
         {1}3.{1}{0}https://zytely.rosfirm.info/m/ {0} —{2} найдет адрес прописки и дату рождения, необходимо знать город {2}
         {1}4.{1}{0}mmnt.ru {0}—{2} найдет упоминания в документах {2}
         {1}5.{1}{0}kad.arbitr.ru {0} {2}дела, рассматриваемые арбитражными судами {0}
         {1}6.{1}{0}bankrot.fedresurs.ru {0}— {2}поиск по банкротам, можно узнать ИНН, СНИЛС и адрес {2}
         {1}7.{1}{0}sudact.ru {0}—{2}судебные и нормативные акты РФ, поиск по участникам и судам {2}
         {1}8.{1}{0}spra.vkaru.net{0} —{2} телефонный справочник по России, Украине, Белоруссии, Казахстану, Литве и Молдове{2}
         {1}9.{1}{0}fssprus.ru http://fssprus.ru/iss/ip/ {0} —{2} проверка задолженностей, для физ. лица {2}
         {1}10.{1}{0}fio.stop-list.info{0} —{2} поиск по ИП и судам, если есть ИНН, то можно узнать больше {2}
         {1}11.{1}{0}gcourts.ru {0}— {2}поиск решений судов общей юрисдикции {2}
         {1}12.{1}{0}service.nalog.ru https://service.nalog.ru/inn.do {0}— {2}найдет ИНН, нужно знать полное ФИО, дату рождения и документ удостоверяющий личность {2}
         {1}13.{1}{0}reestr-dover.ru https://www.reestr-dover.ru/revocations {0} —{2} поиск в списке сведений об отмене доверенности {2}
         {1}14.{1}{0}судебныерешения.рф {0}—{2} найдет судебные решения, документы с ФИО датой и статьей {2}
         {1}15.{1}{0}notariat.ru{0} —{2} поиск в реестре наследственных дел, найдет дату смерти человека и адрес нотариуса оформившее дело {2}
         {1}16.{1}{0}@EyeGodsBot {0}—{2}обратный поиск по GetContact, находит часть номера телефона {2}
         {1}17.{1}{0}@imole_bot{0} {2}поиск по слитым базам, находит паспорт, прописку, авто, ИП и многое другое, нужно знать год, или месяц, или день рождения {2}
         {1}18.{1}{0}nalog.ru (https://service.nalog.ru/inn.do) {0}— {2}найдет ИНН, необходимо указать дату рождения и паспортные данные, дату выдачи не обязательно верно {2}

       {2} Поиск по номерам России {2}                  {0} Осторожнее с ботами, не использовать со своим номером {0}

         {1}1.{1}{0}@Smart_SearchBot{0} —{2} найдет ФИО, дату рождения и адрес {2}
         {1}2.{1}{0}@SafeCallsBot{0}—{2}бесплатные анонимные звонки на любой номер телефона с подменой Caller ID {2}
         {1}3.{1}{0}@mailsearchbot{0}—{2}найдет часть пароля {2}
         {1}4.{1}{0}@AvinfoBot{0}–{2}делает отчет где есть данные из социальных сетей, недвижимости, автомобилей, объявлений и телефонных книжек. Нужно пригласить другой аккаунт для отчета{2}
         {1}5.{1}{0}getcontact.com {0}—{2} найдет информацию о том как записан номер в контактах {2}
         {1}6.{1}{0}@get_kontakt_bot {1}—{2}найдет как записан номер в контактах, большая база контактов/ НЕ В КОЕМ СЛУЧАИ НЕ ДАВАЙ ДОСТУП К КОНТАКТАМ{2} 
         {1}7.{1}{0}PhoneInfoga https://demo.phoneinfoga.crvx.fr/#/ {0}—{2}определят тип номера, дает дорки для номера, определяет город {2}
         {1}8.{1}{0}truecaller.com{0} —{2}телефонная книга, найдет имя и оператора телефона {0}
         {1}9.{1}{0}mirror.bullshit.agency {0}—{2} поиск объявлений по номеру телефона {2}
         {1}10.{1}{0}bases-brothers.ru {0}—{2}поиск номера в объявлениях {2}
         {1}11.{1}{0}account.live.com {0}—{2} проверка привязанности номера к microsoft аккаунту{2}
         {1}12.{1}{0}avinfo.guru {0}—{2} проверка телефона владельца авто, иногда нужен VPN {2}
         {1}13.{1}{0}telefon.stop-list.info {0} —{2}поиск по всем фронтам, иногда нет информации{2}
         {1}14.{1}{0}spravnik.com {0} —{2} поиск по городскому номеру телефона, найдет ФИО и адрес {2}
         {1}15.{1}{0}nuga.app{0} —{2} найдет Instagram аккаунт, авторизация через Google аккаунт и всего 1 попытка {2}
         {1}16.{1}{0}@MyGenisBot {0} {2}найдет имя и фамилию владельца номера {2}
         {1}17.{1}{0}contacts.google.com{0} —{2} находит аккаунт в Google, чтобы узнать как его находить нажмите - /GoogleID {2}
         {1}18.{1}{0}@usersbox_bot {0} —{2} бот найдет аккаунты в ВК у которых в поле номера телефона указан искомый номер {2}
         {1}19.{1}{0}@GetPhone_bot {0}—{2}поиск номера телефона в утекших базах {2}
         {1}20.{1}{0}mysmsbox.ru {0} —{2}определяет чей номер, поиск в Instagram, VK, OK, FB, Twitter, поиск объявлений на Авито, Юла, Из рук в руки, а так же найдет аккаунты в мессенджерах {2}
         {1}21.{1}{0}@clerkinfobot{0} — {2}бот берет данные из приложения getcontact, показывает как записан номер телефона в контактах {2}
         {1}22.{1}{0}@PhoneNumFinder_bot {0} —{2} бот берет данные из приложения getcontact, показывает как записан номер телефона в контактах {2}
         {1}23.{1}{0}imole_bot{0}{2} поиск по слитым базам, находит данные владельца номера, доступна всего 1 бесплатная попытка на аккаунт {2}
         {1}24.{1}{0}@GetFb_bot {0} —{2}бот находит Facebook {2}
         {1}25.{1}{0}globfone.com (https://globfone.com/call-phone/) {0}—{2}бесплатные анонимные звонки на любой номер телефона {2}
         {1}26.{1}{0}@phone_avito_bot{0}—{2}найдет аккаунт на Авито {2}
         {1}27.{1}{0}@Quick_OSINT_bot {0}{2} найдет оператора, email, адрес, как записан в контактах и многое другое {2}
         {1}28.{1}{0}https://pipl.com/ {0}-{2} поисковик по социальным сетям {2}
         {1}29.{1}{0}https://where-you.com/{0}-{2} поисковик по социальным сетям(СНГ) {2}
         {1}30.{1}{0}http://vk.city4me.com/ {0}-{2}шпион ВК {2}
         {1}31.{1}{0}https://www.social-searcher.com/{0}-{2} все посты пользователя {2}
         {1}32.{1}{0}http://socialmention.com/ {0}-{2}все упоминания о человеке {2}
         {1}33.{1}{0}http://nomerorg.me/{0} -{2} телефонная база СНГ (только крупные города) {2}
         {1}34.{1}{0}https://phonenumber.to/{0} -{2} поиск по номеру телефона, адрессу, ФИО {2}
         {1}35.{1}{0}http://spra.vkaru.net/{0} -{2}телефонный справочник Россия, Украина, Беларусь, Казахстан, Латвия, Молдова {2}

       {2} Работа с браузером {2}

         {1}1.{1}{0}xinit.ru https://xinit.ru/whois/ {0} — {2}тотальный скан сайта по всем направлениям {2}
         {1}2.{1}{0}hunter.io{0} —{2} поиск email у сайта {2}
         {1}3.{1}{0}@WhoisDomBot{0}—{2}узнайте информацию об домене {2}
         {1}4.{1}{0}riskiq.com {0} —{2} автоматизированный поиск по всем фронтам {2}
         {1}5.{1}{0}Knock Subdomain Scan (https://github.com/guelfoweb/knock) {0}—{2} находит субдомены и FTP {2}
         {1}6.{1}{0}builtwith.com — технологический профиль сайта, взаимосвязи между сайтами
         {1}7.{1}{0}crimeflare.org (http://www.crimeflare.org:82/cfs.html) {0} {2} — cloudflare раскрыватель {2}
         {1}8.{1}{0}cyber-hub.net (https://cyber-hub.net/domain_resolver.php) {0} {2} — распознаватель cloudflare, статус DNS, перебор поддоменов и многое другое {2}
         {1}9.{1}{0}suip.biz (https://suip.biz/ru/?act=amass) {0} —{2}быстрый и мощный поиск субдоменов, найдет все {2}
         {1}10.{1}{0}urlscan.io {0} {2}сервис для сканирования и анализа сайтов {2}
         {1}11.{1}{0}dnsdumpster.com {0} —{2} инструмент исследования домена который может обнаружить хосты связанные с доменом {2}
         {1}12.{1}{0}cachedview.com {0}—{2} поиск по кэшу Google {2}
         {1}13.{1}{0}recon.secapps.com (https://recon.secapps.com/) {0} {2} — автоматический поиск и создание карт взаимосвязей {2}
         {1}14.{1}{0}censys.io {0}—{2} находит какие серверы и устройства выставлены в сети{2}
         {1}15.{1}{0}virustotal.com {0} —{2}служба пассивного DNS, поиск суб-доменов, поиск в whois и история сертификатов SSL {2}
         {1}16.{1}{0}atsameip.intercode.ca {0} —{2} найдет одинаковые IP у сайта, можно узнать субдомены {2}
         {1}17.{1}{0}spiderfoot.net {0}(r) —{2} автоматический поиск с использованием огромного количества методов, можно использовать в облаке если пройти регистрацию {2}
         {1}18.{1}{0}oldweb.today {0} — {2} просмотреть исторические версии сайтов, можно выбрать вид браузера и дату{2}
         {1}19.{1}{0}crimeflare.net (http://crimeflare.net:83/repeats.html) {0} {2}дает возможность узнать настоящий IP адрес сайта за CloudFlare {2}
         {1}20.{1}{0}dirhunt (https://github.com/Nekmo/dirhunt) (t) {0}—{2}поиск директорий сайта без брута{2}
         {1}21.{1}{0}Amass (https://github.com/OWASP/Amass) (t) {0}—{2} сетевое картирование поверхностей атаки и обнаружение внешних ресурсов с использованием методов сбора инфор... {2}
         {1}22.{1}{0}Photon (https://github.com/s0md3v/Photon) {0} —{2} найдет на сайте файлы, секретные ключи, JS файлы, URL с параметрами {2}
         {1}23.{1}{0}spyse.com (https://spyse.com/search/subdomain) {0} —{2}поиск поддоменов{2} 
         {1}24.{1}{0}webcookies.org {0} —{2} анализ cookies сайта {2}
         {1}25.{1}{0}dnslytics.com (https://dnslytics.com/reverse-analytics) {0} —{2} сайт помогает найти трекеры на сайте{2}
         {1}26.{1}{0}domainwat.ch {0} {2} может искать информацию такую как имя регистранта, адрес, номер телефона, адрес электронной почты из информации WHOIS и историю изменений{2}
         {1}27.{1}{0}findomain (https://github.com/Edu4rdSHL/findomain) {0} —{2} ищет поддомены{2}
         {1}28.{1}{0}yuleak.com {0} — {2}найдет серверы, домены, поддомены, услуги, darkweb, пароли, уязвимости, идентификаторы и многое другое {2}
         {1}29.{1}{0}shodan.io{0} {2}найдет IP адреса и сайты с упоминанием искомого сайта {2}
         {1}30.{1}{0}phonebook.cz {0}—{2} найдет e-mails, субдомены, директории сайта {2}
         {1}31.{1}{0}visualsitemapper.com (http://www.visualsitemapper.com/) {0}—{2}визуализация карты сайта одним грaфиком{2}
         {1}32.{1}{0}@iptools_robot{0} —{2} бот для быстрого поиска информации о домене и ip адресе, найдет whois, настоящий IP за Cloudflare, порты и многое другое {2}
 
          {1}(({1} {0} Вкладка будет пополнятся еженедельно {0} {1})){1}

         {1} Военные авиабазы планеты земля {1}

         {1} {2}Китайские военные авиабазы:{2} {0} https://www.google.com/maps/d/u/0/viewer?mid=1dHrv7E_0mLVEzXdRxIGwaHBU16KEhrTj {0}

         {1} {2}Военные авиабазы по всему миру:{2} {0}https://www.google.com/maps/d/u/0/viewer?mid=1XmSGWNOcO2IwQnB-FFH4ueFPl6WIzKEC {0}

         {2} IP Логер для профи :{2} {0}https://canarytokens.org/generate {0}

  {0}[ {1}1{0} ] {2}Выйти в главное меню...                

'''.format(GNSL, REDL, WHSL)

def main(): 
    page_num = 1
    option = input(REDL + " └──>" + ENDL + " Введите 1 для выхода : "+ENDL + " ") 
    while(1):
        if option == '1':
            print(("{1}[{0}+{1}]{2} Спасибо за использование нашего Exploit.").format(REDL, GNSL, WHSL))
            subprocess.call("python3 osintsan.py", shell=True)
            exit()
            option = input(ENDL + ""+GNSL+"("+REDL + " menu " + GNSL + ")"+ENDL + "> ")

os.system("printf '\033]2;OSINT SAN [ OSINT service ]\a'")
os.system('clear')
print(page_1)
main()
