#!/usr/bin/python
#-*- coding: utf-8 -*-
#Developer by Bafomet
import os
import sys
import readline
import subprocess
# set color
WHSL = '\033[1;32m'
ENDL = '\033[0m'
REDL = '\033[0;31m'
GNSL = '\033[1;34m'
page = '''{1} {1} 
{1}  ______             __              __                                                                                                      
{1} /      \           /  |            /  |                                   
{1}/$$$$$$  |  _______ $$/  _______   _$$ |_     {2}    ______   __    __ {2}
{1}$$ |  $$ | /       |/  |/       \ / $$   |    {2}   /      \ /  |  /  |{2}
{1}$$ |  $$ |/$$$$$$$/ $$ |$$$$$$$  |$$$$$$/     {2}  /$$$$$$  |$$ |  $$ |{2}
{1}$$ |  $$ |$$      \ $$ |$$ |  $$ |  $$ | __   {2}  $$ |  $$/ $$ |  $$ |{2}
{1}$$ \__$$ | $$$$$$  |$$ |$$ |  $$ |  $$ |/  |  {2}  $$ |      $$ \__$$ |{2}
{1}$$    $$/ /     $$/ $$ |$$ |  $$ |  $$  $$/   {2}  $$ |      $$    $$/ {2}
{1} $$$$$$/  $$$$$$$/  $$/ $$/   $$/    $$$$/    {2}  $$/        $$$$$$/  {2}
                                                                                                                                 
{2} OSINT SAN Fram. {2} {0}                                                                                                            

         {0}Вы можете собрать очень большое количество информации по тематике OSINT в telegram каналах.{0}
         {0}Здесь представленны только самые информативные. {0}
         
         {2} Канала OSINT CLUB {2}
  
         {1}[{1}{2} Канал {2}{1}]{1} {0} @osint_club_channel{0}
         {1}[{1}{2} Управляющий {2}{1}]{1} {0}@tochka_osint {0}
         {1}[{1}{2} Продукты {2}{1}]{1}

         {0} @telesint_bot {0}

{1} -----------------------------------------------------------------------------------------------------------{1}

 
       {2} Investigation & Forensic tools{2}
  
         {1}[{1}{2} Канал {2}{1}]{1} {0} @forensictools{0}
         {1}[{1}{2} Управляющий {2}{1}]{1} {0}@beholderishere {0}
         {1}[{1}{2} Продукты {2}{1}]{1}

        {2} Пока нету {2}
{1} -----------------------------------------------------------------------------------------------------------{1}
    
       {2} Записки сетевого выживальщика {2}
  
         {1}[{1}{2} Канал {2}{1}]{1} {0} @NetSurvivalist{0}
         {1}[{1}{2} Управляющий {2}{1}]{1} {0}@beholderishere {0}
         {1}[{1}{2} Продукты {2}{1}]{1}

        {2} Пока нету {2}
{1} -----------------------------------------------------------------------------------------------------------{1}

      {2} Нетипичный ИБ {2}
  
         {1}[{1}{2} Канал {2}{1}]{1} {0} @tmgroupsecurity{0}
         {1}[{1}{2} Управляющий {2}{1}]{1} {0}@mifkelevra {0}
         {1}[{1}{2} Продукты {2}{1}]{1}

        {2}  ? {2}
{1} -----------------------------------------------------------------------------------------------------------{1}


      {2} Интернет - розыск {2}
  
         {1}[{1}{2} Канал {2}{1}]{1} {0} @irozysk{0}
         {1}[{1}{2} Управляющий {2}{1}]{1} {0}@irozysk_bot {0}
         {1}[{1}{2} Продукты {2}{1}]{1}

        {2}  ? {2}
        
{1} -----------------------------------------------------------------------------------------------------------{1}


      {2} Russian OSINT{2}
  
         {1}[{1}{2} Канал {2}{1}]{1} {0} @Russian_OSINT{0}
         {1}[{1}{2} Управляющий {2}{1}]{1} {0}@russian_osint_bot {0}
         {1}[{1}{2} Продукты {2}{1}]{1}

        {2}  ? {2}
{1} -----------------------------------------------------------------------------------------------------------{1}

         

  {0}[ {1}1{0} ] {2}Выйти в главное меню...
'''.format(GNSL, REDL, WHSL)
def main(): 
    option = input(REDL + " └──>" + ENDL + " Введите 1 для выхода : "+ENDL + " ") 
    while(1):
        if option == '1':
            print(("{1}[{0}+{1}]{2} Спасибо за использование нашего Exploit.").format(REDL, GNSL, WHSL))
            subprocess.call("python3 osintsan.py", shell=True)
            exit()
            option = input(ENDL + ""+GNSL+"("+REDL + " menu " + GNSL + ")"+ENDL + "> ")

os.system("printf '\033]2;OSINT SAN [ OSINT service ]\a'")
os.system('clear')
print(page)
main()
