#!/usr/bin/python
#-*- coding: utf-8 -*-
#Developer by Bafomet
import os
import sys
import readline
import subprocess
# set color
WHSL = '\033[1;32m'
ENDL = '\033[0m'
REDL = '\033[0;31m'
GNSL = '\033[1;34m'

page = '''{1} 
 
 ▒█████    ██████  ██▓ ███▄    █ ▄▄▄█████▓     ██████  ▄▄▄       ███▄    █     █    ██  ██▓███  ▓█████▄  ▄▄▄     ▄▄▄█████▓▓█████  ██▀███  
▒██▒  ██▒▒██    ▒ ▓██▒ ██ ▀█   █ ▓  ██▒ ▓▒   ▒██    ▒ ▒████▄     ██ ▀█   █     ██  ▓██▒▓██░  ██▒▒██▀ ██▌▒████▄   ▓  ██▒ ▓▒▓█   ▀ ▓██ ▒ ██▒
▒██░  ██▒░ ▓██▄   ▒██▒▓██  ▀█ ██▒▒ ▓██░ ▒░   ░ ▓██▄   ▒██  ▀█▄  ▓██  ▀█ ██▒   ▓██  ▒██░▓██░ ██▓▒░██   █▌▒██  ▀█▄ ▒ ▓██░ ▒░▒███   ▓██ ░▄█ ▒
▒██   ██░  ▒   ██▒░██░▓██▒  ▐▌██▒░ ▓██▓ ░      ▒   ██▒░██▄▄▄▄██ ▓██▒  ▐▌██▒   ▓▓█  ░██░▒██▄█▓▒ ▒░▓█▄   ▌░██▄▄▄▄██░ ▓██▓ ░ ▒▓█  ▄ ▒██▀▀█▄  
░ ████▓▒░▒██████▒▒░██░▒██░   ▓██░  ▒██▒ ░    ▒██████▒▒ ▓█   ▓██▒▒██░   ▓██░   ▒▒█████▓ ▒██▒ ░  ░░▒████▓  ▓█   ▓██▒ ▒██▒ ░ ░▒████▒░██▓ ▒██▒
░ ▒░▒░▒░ ▒ ▒▓▒ ▒ ░░▓  ░ ▒░   ▒ ▒   ▒ ░░      ▒ ▒▓▒ ▒ ░ ▒▒   ▓▒█░░ ▒░   ▒ ▒    ░▒▓▒ ▒ ▒ ▒▓▒░ ░  ░ ▒▒▓  ▒  ▒▒   ▓▒█░ ▒ ░░   ░░ ▒░ ░░ ▒▓ ░▒▓░
  ░ ▒ ▒░ ░ ░▒  ░ ░ ▒ ░░ ░░   ░ ▒░    ░       ░ ░▒  ░ ░  ▒   ▒▒ ░░ ░░   ░ ▒░   ░░▒░ ░ ░ ░▒ ░      ░ ▒  ▒   ▒   ▒▒ ░   ░     ░ ░  ░  ░▒ ░ ▒░
░ ░ ░ ▒  ░  ░  ░   ▒ ░   ░   ░ ░   ░         ░  ░  ░    ░   ▒      ░   ░ ░     ░░░ ░ ░ ░░        ░ ░  ░   ░   ▒    ░         ░     ░░   ░ 
    ░ ░        ░   ░           ░                   ░        ░  ░         ░       ░                 ░          ░  ░           ░  ░   ░     
                                                                                                 ░                                         

{2}  Список изменений обновлений и инструкция по установке...   

{0}  Обновление загружается ввиде папки, После вам нужно скопировать все из папки update-osint
  в папку с самим эксплойтом OsintSan с заменой файлов.

  Но возможно могут слететь ваши API, заранее прошу извинения.
  Обновления выходят раз в месяц. Патчи могут выходить раз в две недели.

 {2} Telegram канал:{1} https://t.me/osint_san_framework{2} обновлений и поддержки {2} 
                  
  {0}[ {1}1{0} ] {2}Выйти...       {0}[ {1}0{0} ] {2} Загрузить обновление...
'''.format(GNSL, REDL, WHSL)

def main():
    option = input(ENDL + "  └──> Введите номер "+GNSL+"("+REDL + " menu " + GNSL + ")"+ENDL + "> ")
        
    while(1):
        if option == '1':
            print(("{1}[{0}+{1}]{2} Спасибо за использование нашего Exploit.").format(REDL, GNSL, WHSL))
            subprocess.call("python3 osintsan.py", shell=True) 
            exit()

        elif option == '0':
            print(("{1}[ {0}+{1} ]{2} Загрузка с github...{3}").format(REDL, GNSL, WHSL, ENDL))
            os.system("git clone https://github.com/Bafomet666/update-osint")
            subprocess.call("python3 osintsan.py", shell=True) 
            exit()
            break
        else:
            print("Спасибо за использование...")
            option = input(ENDL + ""+GNSL+"("+REDL + " menu " + GNSL + ")"+ENDL + "> ")

os.system("printf '\033]2;OSINT SAN [ updater ]\a'")
os.system('clear')
print(page)
main()
