from module.utils import COLORS

import random
import os
#-*- coding: utf-8 -*-
# dev by bafomet

BANNER1 = fr""" {COLORS.REDL}
     ______    ________  __    _____  ___  ___________        _______    _______     ______
    /    " \  /"       )|" \  (\    \|"  \("     _   ")      |   __ "\  /"      \   /    " \
   // ____  \(:   \___/ ||  | |.\    \    |)__/   \__/       (. |__) :)|:        | // ____  \
  /  /    ) :)\___  \   |:  | |: \.   \   |   \ _ /          |:  ____/ |_____/   )/  /    ) :)
 (: (____/ //  __/   \  |.  | |.  \    \. |   |.  |          (|  /      //      /(: (____/ //
  \        /  /" \   :) /\  |\|    \    \ |   \:  |         /|__/ \    |:  __   \ \        /
   \ _____/  (_______/ (__\_|_)\___|\____\)    \__|        (_______)   |__|  \___) \ _____/

{COLORS.GNSL} Тайна это безопасность, а безопасность это победа
 
 {COLORS.REDL}{COLORS.GNSL}[{COLORS.WHSL}Official channel{COLORS.GNSL} tg {COLORS.REDL}@osint_san_framework{COLORS.REDL}{COLORS.GNSL}]
 """
 
BANNER2 = fr""" {COLORS.FIOL}
    ______    ________  __    _____  ___  ___________       ________     __      _____  ___   ___  ___ 
   /    " \  /"       )|" \  (\"   \|"  \("     _   ")     /"       )   /""\    (\"   \|"  \ |"  \/"  |
  // ____  \(:   \___/ ||  | |.\\   \    |)__/  \\__/     (:   \___/   /    \   |.\\   \    | \   \  / 
 /  /    ) :)\___  \   |:  | |: \.   \\  |   \\_ /         \___  \    /' /\  \  |: \.   \\  |  \\  \/  
(: (____/ //  __/  \\  |.  | |.  \    \. |   |.  |          __/  \\  //  __'  \ |.  \    \. |  /   /  
 \        /  /" \   :) /\  |\|    \    \ |   \:  |         /" \   :)/   /  \\  \|    \    \ | /   / 
  \"_____/  (_______/ (__\_|_)\___|\____\)    \__|        (_______/(___/    \___)\___|\____\)|___/   

{COLORS.GNSL} Каждое новое открытие в OSINT углубляет ваши знания, согласитесь
 
 {COLORS.REDL}{COLORS.GNSL}[{COLORS.WHSL}Official channel{COLORS.GNSL} tg {COLORS.REDL}@osint_san_framework{COLORS.REDL}{COLORS.GNSL}] """
 
BANNER3 = fr""" {COLORS.FIOL}
    ___     ______   _____  ____  _____  _________         ______        _       ____  _____ 
  .'   `. .' ____ \ |_   _||_   \|_   _||  _   _  |      .' ____ \      / \     |_   \|_   _| 
 /  .-.  \| (___ \_|  | |    |   \ | |  |_/ | | \_|______| (___ \_|    / _ \      |   \ | |
 | |   | | _.____`.   | |    | |\ \| |      | |   |______|_.____`.    / ___ \     | |\ \| |  
 \  `-'  /| \____) | _| |_  _| |_\   |_    _| |_         | \____) | _/ /   \ \_  _| |_\   |_ 
  `.___.'  \______.'|_____||_____|\____|  |_____|         \______.'|____| |____||_____|\____|
                                                                                                                           
{COLORS.GNSL} Любопытство — это ключ к совершенству. Увлеченный человек готов прилагать усилия, 
 чтобы снова и снова находить ответы и удовлетворять свою тягу к познанию.
 
 {COLORS.REDL}{COLORS.GNSL}[{COLORS.WHSL}Official channel{COLORS.GNSL} tg {COLORS.REDL}@osint_san_framework{COLORS.REDL}{COLORS.GNSL}]
"""

def show_banner(*, clear=False):
    if clear:
        os.system("clear")
    banner = random.SystemRandom().choice([BANNER1, BANNER2, BANNER3])
    print(banner)


if __name__ == "__main__":
    show_banner()
